<?php
// ========================= Упражнения 2-1 ==============================
?>
<?php
$a = 1;
$b = false;

if ($a) {
    echo '$a=' . $a . ' - истина <br>';
} else {
    echo '$a=' . $a . ' - ложь <br>';
}

if ($b) {
    echo '$b=' . $b . ' - истина <br>';
} else {
    echo '$b=' . $b . ' - ложь <br>';
}
?>

<?php
// ========================= Упражнения 2-2 ==============================
?>
<p> Наибольшее число: <p>
        <?php
        srand();
        $x = rand(1, 10);
        $y = rand(1, 10);
        print('$x =' . $x . "<br>");
        print('$y =' . $y . "<br>");
        if ($x > $y)  echo ("Наибольшее = " . $x);
        elseif ($x < $y)  echo ("Наибольшее = " . $y);
        else  print("Наибольшего нет");
        ?>

        <?php
        // ========================= Упражнения 2-3 ==============================
        ?>

        <?php
        $а = "А";
        switch ($а) {
            case 'А':
                echo 'Переменная имеет значение "А"';
                break;
            case 'В':
                echo 'Переменная имеет значение "В"';
                break;
            default:
                echo 'Ответ не найден ';
        }
        ?>

        <?php
        // ========================= Упражнения 2-4 ==============================
        ?>

        <?php
        $dn = rand(1, 7);
        print($dn . " - номер дня недели <br>");
        switch ($dn) {
            case 1:
                print("это понедельник");
                break;
            case 2:
                print("это вторник");
                break;
            case 3:
                print("это среда");
                break;
            case 4:
                print("это четверг");
                break;
            case 5:
                print("это пятница");
                break;
            case 6:
                print("это суббота");
                break;
            case 7:
                print("это воскресенье");
        }
        ?>

        <?php
        // ========================= Упражнения 2-5 ==============================
        ?>

        <?php
        $var = 5;
        $i = 0;
        while (++$i <= $var) {
            echo $i . ' ';
        }
        ?>

        <?php
        // ========================= Упражнения 2-6 ==============================
        ?>
        <?php
        $a = rand(1, 10);
        $b = rand(10, 20);
        print("<p> Числа из отрезка [" . $a . "," . $b . "]: <br>");
        while ($a <= $b) {
            echo ($a . "<br>");
            $a = ++$a;
        }
        ?>

        <?php
        // ========================= Упражнения 2-7 ==============================
        ?>
        <?php
        $a = rand(-5, 0);
        $b = rand(0, 5);
        print("<p> Числа из отрезка [" . $a . "," . $b . "]: <br>");
        do {
            echo ($a . "<br>");
            $a = ++$a;
        } while ($a <= $b);
        ?>

        <?php
        // ========================= Упражнения 2-8 ==============================
        ?>
        <?php
        $a = rand(1, 10);
        $b = rand(10, 20);
        print("<p> Числа из отрезка [" . $a . "," . $b . "]: <br>");
        for ($i = $a; $i <= $b; ++$i) {
            echo ($a . "<br>");
            $a = ++$a;
        }
        ?>

        <?php
        // ========================= Упражнения 2-9 ==============================
        ?>

        <HTML>
        <TITLE> Таблица умножения </TITLE>

        <BODY>
            <TABLE border=1>
                <?php
                for ($i = 1; $i <= 10; $i++) {        // запускаем первый цикл
                    echo ("<tr>");      // начало строки таблицы
                    for ($k = 1; $k <= 10; $k++) {          // запускаем второй цикл
                        echo ("<td align=center>");          // открываем ячейку таблицы
                        $p = $i * $k;          // находим произведение двух чисел и...
                        echo ($p);          // выводим его,
                        echo ("</td>");          // а потом закрываем ячейку
                    }
                    echo ("</tr>");     // конец строки таблицы
                }
                ?>
            </TABLE>
        </BODY>

        </HTML>